mis/models/Rolepower.php

    public static function getPowersByRoleId($id){
        $powers = self::find()
            ->where(['role_id' => $id, 'is_del' => 0])
            ->asArray()
            ->one();
---
SELECT * FROM `role_power` WHERE (`role_id`=1) AND (`is_del`=0)