mis/models/SystemUsers.php

    public static function findByMobile($mobile)
    {
        return static::findOne(['mobile' => $mobile, 'is_del' => 0]);
---
SELECT * FROM `system_users` WHERE (`mobile`='15210983104') AND (`is_del`=0)

    public static function checkUserPassport($mobile,$password){
        if(!$mobile || !$password){
            return false;
        }
        $ret = self::find()
            ->where(['mobile' => trim($mobile)])
            ->asArray()
            ->one();
---
SELECT * FROM `system_users` WHERE `mobile`='15210983104'